In [1]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [2]:
df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket','Cabin', 'Embarked'], axis = 'columns', inplace= True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [3]:
inputs = df.drop(['Survived'], axis = 'columns')
target = df.Survived

In [4]:
# Creating dummies for the Sex column

dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [5]:
# Adding dummies to inputs
inputs  = pd.concat([inputs, dummies], axis= 'columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [6]:
# dropping sex column and male column(dummy variable trap theory)

inputs.drop(['Sex','male'], axis = 'columns', inplace = True)
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [7]:
# Finding NaN values in Inputs
inputs.isnull().sum()

Pclass      0
Age       177
Fare        0
female      0
dtype: int64

In [8]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [9]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [10]:
 from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(inputs, target, test_size = 0.2)

In [11]:
len(x_train)

712

In [12]:
len(x_test)

179

In [13]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [14]:
model.fit(x_train, y_train)

GaussianNB()

In [15]:
model.predict(x_test)

array([1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0,
       1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1,
       1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0,
       0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0,
       0, 0, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0,
       0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 0, 0, 1,
       0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 1, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0,
       1, 0, 0], dtype=int64)

In [16]:
model.score(x_test, y_test)

0.7821229050279329

In [17]:
x_test[0:10]

     Pclass   Age      Fare  female
98        2  34.0   23.0000       1
684       2  60.0   39.0000       0
51        3  21.0    7.8000       0
383       1  35.0   52.0000       1
516       2  34.0   10.5000       1
90        3  29.0    8.0500       0
74        3  32.0   56.4958       0
688       3  18.0    7.7958       0
195       1  58.0  146.5208       1
222       3  51.0    8.0500       0

In [18]:
y_test[0:10]

98     1
684    0
51     0
383    1
516    1
90     0
74     1
688    0
195    1
222    0
Name: Survived, dtype: int64

In [19]:
model.predict(x_test[:10])

array([1, 0, 0, 1, 1, 0, 0, 0, 1, 0], dtype=int64)

In [20]:
# probability of each person survived 

model.predict_proba(x_test[:10])   # First 10 passengers

array([[2.45051454e-01, 7.54948546e-01],
       [9.20315310e-01, 7.96846899e-02],
       [9.56519145e-01, 4.34808547e-02],
       [5.03746874e-02, 9.49625313e-01],
       [2.48597215e-01, 7.51402785e-01],
       [9.63845071e-01, 3.61549295e-02],
       [9.30837896e-01, 6.91621044e-02],
       [9.52748571e-01, 4.72514290e-02],
       [5.00816103e-05, 9.99949918e-01],
       [9.70537232e-01, 2.94627685e-02]])

0 - didnt survived
1 - survived

44.64% prob that person didn't survived and 55.35% prob that person survived that is why it is 1 in model.predict(x_test[:10])

93.49% prob - didnt survived and 6.5% - per survied, So its 0

#### Calculating the score using cross validation

In [21]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),x_train, y_train, cv=5)

array([0.7972028 , 0.82517483, 0.75352113, 0.8028169 , 0.71126761])